OK I reverted the state back to before I merged this, and the new `plan` with this revert:

```log
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azurerm_app_service_source_control.main must be replaced
-/+ resource "azurerm_app_service_source_control" "main" {
      ~ id                     = "/subscriptions/xxx/resourceGroups/RG-CDT-PUB-VIP-CALITP-D-001/providers/Microsoft.Web/sites/AS-CDT-PUB-VIP-CALITP-D-001" -> (known after apply)
      ~ scm_type               = "GitHub" -> (known after apply)
      ~ uses_github_action     = false -> (known after apply)
        # (7 unchanged attributes hidden)

      + github_action_configuration { # forces replacement
          + generate_workflow_file = false # forces replacement
          + linux_action           = (known after apply)

          + container_configuration {
              + image_name   = "cal-itp/benefits" # forces replacement
              + registry_url = "[https://ghcr.io/"](https://ghcr.io/%22) # forces replacement
            }
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```